#### PlumbingUtils Members

---

|  |
| --- |
| PlumbingUtils Class   Methods   See Also |

The  PlumbingUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | BreakCurve | Breaks the pipe curve into two parts at the given position. |
| Public method Static member | ConnectPipePlaceholdersAtCross(Document, ElementId, ElementId) | Connects placeholders that looks like Cross connection. |
| Public method Static member | ConnectPipePlaceholdersAtCross(Document, ElementId, ElementId, ElementId) | Connects placeholders that looks like Cross connection. |
| Public method Static member | ConnectPipePlaceholdersAtCross(Document, Connector, Connector, Connector, Connector) | Connects placeholders that looks like Cross connection. |
| Public method Static member | ConnectPipePlaceholdersAtElbow(Document, Connector, Connector) | Connects placeholders that looks like elbow connection. |
| Public method Static member | ConnectPipePlaceholdersAtElbow(Document, ElementId, ElementId) | Connects placeholders that looks like elbow connection. |
| Public method Static member | ConnectPipePlaceholdersAtTee(Document, ElementId, ElementId) | Connects two placeholders that looks like Tee connection. |
| Public method Static member | ConnectPipePlaceholdersAtTee(Document, Connector, Connector, Connector) | Connects three placeholders that looks like Tee connection. |
| Public method Static member | ConvertPipePlaceholders | Converts a collection of pipe placeholder elements into pipe elements. |
| Public method Static member | HasOpenConnector | Checks if there is open piping connector for the given element - object of pipe curve, pipe fitting or pipe accessory. |
| Public method Static member | PlaceCapOnOpenEnds | Places caps on the open connectors of the pipe curve, pipe fitting or pipe accessory. |

# See Also

PlumbingUtils Class

Autodesk.Revit.DB.Plumbing Namespace